#Область ОбработчикиКомандФормы

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ДанныеОбъекта = ЭтотОбъект.Объект;
	
	Если Не ЗначениеЗаполнено(ДанныеОбъекта.Код) Тогда
		ВызватьИсключение НСтр("ru = 'Заполните код перед заполнением!'");
	КонецЕсли;
	
	ТаблицаЗаполнения = ДанныеОбъекта.Состав.Выгрузить();
	ТаблицаЗаполнения.Очистить();
	
	РезультатПолученияИндекса = Справочники.УА_Индексы.ТаблицаЗаполненияСостава(ДанныеОбъекта.Код, ТаблицаЗаполнения);
	
	Если РезультатПолученияИндекса.ПроизошлаОшибка Тогда
		ВызватьИсключение РезультатПолученияИндекса.ТекстОшибки;
	КонецЕсли;
	
	ДанныеОбъекта.Состав.Загрузить(РезультатПолученияИндекса.Данные);

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти
