#Область ПрограммныйИнтерфейс

#Область Цены

Функция ДлинаТикера() Экспорт
    Возврат 10;
КонецФункции

Функция ДлинаЦены() Экспорт
    Возврат 10;
КонецФункции

Функция ТочностьЦены() Экспорт
	Возврат 2;
КонецФункции

Функция ДлинаЛота() Экспорт
    Возврат 10;
КонецФункции

Функция ТочностьЛота() Экспорт
	Возврат 4;
КонецФункции

#КонецОбласти

#Область ПарсингДанныхИндекса

Функция ИндексТикер() Экспорт
    Возврат 2;
КонецФункции

Функция ИндексВес() Экспорт
    Возврат 5;
КонецФункции

Функция ИндексНаименование() Экспорт
	Возврат 3; 	
КонецФункции

Функция РазмерСтраницыСЭлементамиИндекса() Экспорт
	Возврат 100;
КонецФункции

#КонецОбласти

#КонецОбласти