
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Портфель = Справочники.УП_Портфели.ПортфельПоУмолчанию();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата(); // Используем стандартный объект результата

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндексПортфель", ТаблицаИндексПортфель);
	Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
	Запрос.Текст = "ВЫБРАТЬ
	|	тИП.Наименование КАК Наименование,
	|	тИП.Тикер КАК Тикер,
	|	тИП.Вес КАК Вес,
	|	тИП.Количество КАК Количество
	|ПОМЕСТИТЬ врИП
	|ИЗ
	|	&ТаблицаИндексПортфель КАК тИП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЦ.Тикер КАК Тикер,
	|	тЦ.Цена КАК Цена
	|ПОМЕСТИТЬ врЦ
	|ИЗ
	|	&ТаблицаЦен КАК тЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врИП.Наименование КАК Наименование,
	|	врИП.Тикер КАК Тикер,
	|	врЦ.Цена КАК Цена,
	|	ЕСТЬNULL(врИП.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(врЦ.Цена, 0) * ЕСТЬNULL(врИП.Количество, 0) КАК Сумма,
	|	ЕСТЬNULL(врИП.Вес, 0) КАК ВесВИндексе,
	|	0 КАК ВесВПортфеле
	|ИЗ
	|	врИП КАК врИП
	|		ЛЕВОЕ СОЕДИНЕНИЕ врЦ КАК врЦ
	|		ПО врИП.Тикер = врЦ.Тикер";
	Попытка
		ТаблицаСЦенами = Запрос.Выполнить().Выгрузить();
		Результат.Данные = ТаблицаСЦенами;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для дополнения ценами: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаЦен(Тикеры)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();

	ЗапросЦен = Новый Запрос;
	ЗапросЦен.УстановитьПараметр("Инструменты", Тикеры);
	
	ЗапросЦен.Текст = "ВЫБРАТЬ
	|	УП_ЦеныИнструментовСрезПоследних.Инструмент КАК Инструмент,
	|	УП_ЦеныИнструментовСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.УП_ЦеныИнструментов.СрезПоследних КАК УП_ЦеныИнструментовСрезПоследних
	|ГДЕ
	|	УП_ЦеныИнструментовСрезПоследних.Инструмент В(&Инструменты)";
	
	ТаблицаЦен = ЗапросЦен.Выполнить().Выгрузить();

	Результат.Данные = ТаблицаЦен;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция _ТаблицаИндексПортфель()
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();

	РезультатТаблицыИндекса = _ТаблицаПозицийИндекса(Индекс);
	
	Если РезультатТаблицыИндекса.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыИндекса;
	КонецЕсли;
	
	ТаблицаИндекса = РезультатТаблицыИндекса.Данные;
	ТаблицаИндекса.Сортировать("Вес Убыв");

	РезультатТаблицыПортфеля = _ТаблицаДанныхПортфеля(Портфель);
	
	Если РезультатТаблицыПортфеля.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыПортфеля; // Передаем ошибку выше
	КонецЕсли;
	ТаблицаПортфеля = РезультатТаблицыПортфеля.Данные;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндекса",  ТаблицаИндекса);
	Запрос.УстановитьПараметр("ТаблицаПортфеля", ТаблицаПортфеля);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТИ.Наименование КАК Наименование,
	|	ТИ.Тикер КАК Тикер,
	|	ТИ.Вес КАК Вес
	|ПОМЕСТИТЬ врИ
	|ИЗ
	|	&ТаблицаИндекса КАК ТИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТП.Наименование КАК Наименование,
	|	ТП.Тикер КАК Тикер,
	|	ТП.Количество КАК Количество
	|ПОМЕСТИТЬ врП
	|ИЗ
	|	&ТаблицаПортфеля КАК ТП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вИ.Наименование, вП.Наименование) КАК Наименование,
	|	ЕСТЬNULL(вИ.Тикер, вП.Тикер) КАК Тикер,
	|	ЕСТЬNULL(вИ.Вес, 0) КАК Вес,
	|	ЕСТЬNULL(вП.Количество, 0) КАК Количество
	|ИЗ
	|	врИ КАК вИ
	|		ПОЛНОЕ СОЕДИНЕНИЕ врП КАК вП
	|		ПО вИ.Тикер = вП.Тикер";
	Попытка
		РезультирующаяТаблица = Запрос.Выполнить().Выгрузить();
		Результат.Данные = РезультирующаяТаблица;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для объединения данных индекса и портфеля: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаДанныхПортфеля(Портфель)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();

	ЗапросДанных = Новый Запрос;
	ЗапросДанных.УстановитьПараметр("Портфель", Портфель);
	
	ЗапросДанных.Текст = "ВЫБРАТЬ
	|	УП_ПортфелиСостав.Инструмент КАК Инструмент,
	|	УП_ПортфелиСостав.Количество КАК Количество
	|ИЗ
	|	Справочник.УП_Портфели.Состав КАК УП_ПортфелиСостав
	|ГДЕ
	|	УП_ПортфелиСостав.Ссылка = &Портфель";

	ТаблицаПортфеля = ЗапросДанных.Выполнить().Выгрузить();
	
	Результат.Данные = ТаблицаПортфеля;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаПозицийИндекса(Индекс)
	
	Результат = УП_ОбщегоНазначения.ОписаниеРезультата();

	Если НЕ ЗначениеЗаполнено(Индекс) Тогда
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Не указан индекс для получения позиций";
		Возврат Результат;
	КонецЕсли;

	Попытка
		ЗапросПозиций = Новый Запрос;
		ЗапросПозиций.УстановитьПараметр("Индекс", Индекс);
		
		ЗапросПозиций.Текст = "ВЫБРАТЬ
		|	УП_ИндексыСостав.Инструмент КАК Инструмент,
		|	УП_ИндексыСостав.Вес КАК Вес
		|ИЗ
		|	Справочник.УП_Индексы.Состав КАК УП_ИндексыСостав
		|ГДЕ
		|	УП_ИндексыСостав.Ссылка = &Индекс
		|	И НЕ УП_ИндексыСостав.Инструмент.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УП_ИндексыСостав.Вес УБЫВ";
		
		ТаблицаПозиций = ЗапросПозиций.Выполнить().Выгрузить();
		
		Результат.Данные = ТаблицаПозиций;
		
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при получении позиций индекса: " + ОписаниеОшибки();
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИндекс(Команда)
	ПолучитьИндексНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьИндексНаСервере()

	РезультатТаблицыИндексПортфель = _ТаблицаИндексПортфель();
	Если РезультатТаблицыИндексПортфель.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении данных портфеля: " + РезультатТаблицыИндексПортфель.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаИндексПортфель = РезультатТаблицыИндексПортфель.Данные;
	Если ТаблицаИндексПортфель.Количество() = 0 Тогда
		Сообщить("В портфеле нет позиций для обработки.");
		Возврат;
	КонецЕсли;

	Тикеры = ТаблицаИндексПортфель.ВыгрузитьКолонку("Тикер");
	
	РезультатТаблицыЦен = _ТаблицаЦен(Тикеры);
	Если РезультатТаблицыЦен.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении цен акций: " + РезультатТаблицыЦен.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаЦен = РезультатТаблицыЦен.Данные;

	РезультатТаблицыСЦенами = _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен);
	Если РезультатТаблицыСЦенами.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при дополнении данных ценами: " + РезультатТаблицыСЦенами.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаСЦенами = РезультатТаблицыСЦенами.Данные;

	СуммаПортфеляАкций = ТаблицаСЦенами.Итог("Сумма");

	Для Каждого СтрокаТаблицы Из ТаблицаСЦенами Цикл
		Если СуммаПортфеляАкций <> 0 Тогда
			СтрокаТаблицы.ВесВПортфеле = (СтрокаТаблицы.Сумма / СуммаПортфеляАкций) * 100;
		Иначе
			СтрокаТаблицы.ВесВПортфеле = 0;
		КонецЕсли;
	КонецЦикла;

	ИтоговаяТаблица.Загрузить(ТаблицаСЦенами);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнструментыНаСервере()
	
	Для Каждого Инструмент Из ИтоговаяТаблица Цикл
		
		НовыйИнструмент = Справочники.УП_БиржевыеИнструменты.СоздатьЭлемент();
		НовыйИнструмент.Наименование = Инструмент.Наименование;
		НовыйИнструмент.Код = Инструмент.Тикер;
		
		НовыйИнструмент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнструменты(Команда)
	ЗаполнитьИнструментыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестАпиНаСервере()
	
	ЗапросТикеров = Новый Запрос;
	ЗапросТикеров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УП_ИндексыСостав.Инструмент КАК Ссылка
	|ПОМЕСТИТЬ врИнструменты
	|ИЗ
	|	Справочник.УП_Индексы.Состав КАК УП_ИндексыСостав
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УП_ПортфелиСостав.Инструмент
	|ИЗ
	|	Справочник.УП_Портфели.Состав КАК УП_ПортфелиСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БИ.Код КАК Тикер
	|ИЗ
	|	врИнструменты КАК врИнструменты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УП_БиржевыеИнструменты КАК БИ
	|		ПО (БИ.Ссылка = врИнструменты.Ссылка)";
	
	Тикеры = ЗапросТикеров.Выполнить().Выгрузить().ВыгрузитьКолонку("Тикер");
	
	Клиент = Обработки.УП_КлиентМосбиржи.Создать().Инит();
	Данные = Клиент.ДанныеИнструментов(Тикеры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестАпи(Команда)
	ТестАпиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	РегистрыСведений.УП_ЦеныИнструментов.ЗаполнитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти