#Область ПрограммныйИнтерфейс

Функция ОписаниеРезультата() Экспорт

	Результат = Новый Структура;

	Результат.Вставить("ПроизошлаОшибка", Ложь);
	Результат.Вставить("ТекстОшибки", 	  "");
	Результат.Вставить("Данные");

	Возврат Результат;
	
КонецФункции

Функция ФиксированныеДанные(Данные) Экспорт

	Если ТипЗнч(Данные) = Тип("Массив") Тогда

		Массив = Новый Массив;
		
		Для Каждого Значение Из Данные Цикл
			
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Массив.Добавить(ФиксированныеДанные(Значение));
			Иначе
				Массив.Добавить(Значение);
			КонецЕсли;
			
		КонецЦикла;

		Результат = Новый ФиксированныйМассив(Массив);
	  
	ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
		ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда

		Коллекция = Неопределено;
		
		Если ТипЗнч(Данные) = Тип("Структура") Тогда
	  		Коллекция = Новый Структура;
		Иначе
	  		Коллекция = Новый Соответствие;
		КонецЕсли;
		
	    Для каждого КлючИЗначение Из Данные Цикл

			Значение = КлючИЗначение.Значение;
			
			Если ТипЗнч(Значение) = Тип("Структура")
				ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
				ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
				
				Коллекция.Вставить(КлючИЗначение.Ключ, ФиксированныеДанные(Значение));
			Иначе
				Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
			КонецЕсли;

	    КонецЦикла;

		Если ТипЗнч(Данные) = Тип("Структура") Тогда
	    	Результат = Новый ФиксированнаяСтруктура(Коллекция);
	    Иначе
	      	Результат = Новый ФиксированноеСоответствие(Коллекция);
	    КонецЕсли;

	Иначе
		Результат = Данные;
	КонецЕсли;
  
  	Возврат Результат;

КонецФункции

#КонецОбласти